PUNTATION_MARKS = '.,;!?—:()\',\"«»“„[]{}'
counter = {}


def delete_punctuation_marks(text):
    """Удаляет знаки препинания"""
    for letter in PUNTATION_MARKS:
        text = text.replace(letter, ' ')
    
    return text


def calc_word_in_text(text):
    """Считает слова в тексте"""
    text = delete_punctuation_marks(text).lower()
    text_lst = text.split()
    
    for word in text_lst:
        if not counter.get(word):
            counter.setdefault(word, 1)
        else:
            counter[word] += 1
        
    return sort_counter_words(counter)[:10]


def sort_counter_words(counter):
    """Сортировка по частоте слов"""
    counter_lst = list(counter.items())
    counter_lst.sort(key=lambda x: x[1], reverse=True)
    return counter_lst


if __name__ == '__main__':
    text = """Дмитрий Дубин Изображение Дмитрия Дубина Художник — Тая Макаревич
    Изображение Дмитрия Дубина Художник — Тая Макаревич История публикаций
    Издатель	Bubble Comics Дебют	«Майор Гром» № 1: „Чумной Доктор. Часть 1“ (октябрь 2012)
    Авторы	Артём Габрелянов Евгений Федотов (сценаристы) Константин Тарасов (художник)[1]
    Характеристики персонажа Позиция	Добро Семейное положение	холост, какое-то время встречался с Лилией Абраменко Род занятий	сотрудник полиции Санкт-Петербурга
    Команды и организации МВД России Союзники Игорь Гром Фёдор Прокопенко Лилия Абраменко Ирина «Шарлотта» Валентин «Калигари» Гашпаров Уля Юлия Пчёлкина Враги Чумной Доктор Олег Волков Вениамин Рубинштейн Три принцессы Кирк О’Райли Дми́трий Ду́бин — персонаж российских комиксов издательства Bubble Comics, а также один из главных героев комиксов франшизы «Майор Гром». Дебю Дубина состоялся в первом выпуске комикса «Майор Гром», вышедшем в октябре 2012 года. Разработкой героя занимались сценаристы Артём Габрелянов и Евгений Федотов, а дизайном и внешним видом — художник Константин Тарасов. Дима Дубин был первоначальным вариантом Игоря Грома, но после нескольких изменений в сценарии стал отдельным героем. В фильме по мотивам комиксов о майоре Громе «Майор Гром: Чумной Доктор» роль Димы Дубина исполнил актёр Александр Сетейкин. Он вернётся к своей роли в сиквеле фильма — «Майор Гром: Игра».
    
    Дмитрий Дубин — следователь из Санкт-Петербурга, лучший друг Игоря Грома и его бывший напарник. По характеру несколько простодушен и слегка наивен. На протяжении всех похождений Игоря Грома всячески поддерживает его, сначала как его напарник, а после отставки Грома из полиции — как друг, который время от времени использует своё служебное положение, чтобы помогать Грому в его собственных расследованиях. Дубин не столь опытный сыщик и боец, как Гром, но, тем не менее, достаточно решителен в борьбе с преступностью. Некоторое время Дмитрий состоял в отношениях с Лилией Абраменко, но у пары ничего не вышло и они расстались.
    
    Персонаж получил умеренно положительную реакцию у критиков и комикс-обозревателей. Журналисты называли Дубина более реалистичным полицейским, чем сам главный герой франшизы Игорь Гром, а также сравнивали его с киноперсонажем Шуриком из фильма «Операция „Ы“ и другие приключения Шурика». Главным недостатком героя называлось его слабое раскрытие и его редкое участие в действиях комиксов о Громе. Дмитрий Дубин также занял третье место по итогам опроса «Любимый мужской персонаж комиксов» на странице издательства Bubble Comics в социальной сети «ВКонтакте»."""
    print(*calc_word_in_text(text))
